<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bc29102db4900c87d4d268d03b2af4295a5705022a56449a9844a11fffbcdae8","plan_job_ref":"Job Create terraform plan #17 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544313325","plan_hash":"750de9aa287f49f5997b0e84d5d2529a5f6313a4ab34ea6d735066f57ac8ba48","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip" -> "./lambda/rotate_install_token.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-17T05:27:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.null_resource.archive[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "null_resource" "archive" {
      - id       = "4972842440335601011" -> null
      - triggers = {
          - "filename"  = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip"
          - "timestamp" = "1697478871006104000"
        } -> null
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #17](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544313325)